#+title: Lecture Notes

*** iterator example
#+begin_src python :exports :tangle

def fib_iter(n):

    assert n > 0, "argument must be greater than 0"

    l = [0, 1]
    if n <= len(l):
        return iter(l[:n-1])
    c = 2


    while c < n:
        l.append(l[c-1] + l[c-2])
        c = c + 1

    return iter(l)

n = 11

x = fib_iter(n)

l = []

for i in range(0, n):
     l.append(next(x))

return l
#+end_src

#+RESULTS:
| 0 | 1 | 1 | 2 | 3 | 5 | 8 | 13 | 21 | 34 | 55 |


** Trees

#+begin_src python :exports tangle:yes :results output


"""

trees


"""


def get_label(tree):
    return tree[0]

def get_branches(tree):
    return tree[1:]

def is_tree(tree):
    if type(tree) != list or len(tree) < 1:
        return False
    for branch in get_branches(tree):
        if not is_tree(branch):
            return False
    return True

def is_leaf(tree):
    return not get_branches(tree)

def tree(label, branches=[]):
    for branch in branches:
        assert is_tree(branch)
    return [label] + list(branches)

#awful declaration notation but it shows the structure
"""
            8
          /   \
        4       3
      /  \    /  \
     2    3   1   1
                 / \
                1   1
"""
t = tree(8,\
            [tree(4,\
                  [tree(2,\
                        []),\
                   tree(3,\
                        [])]),\
             tree(3,\
                  [tree(1, []),\
                   tree(1,\
                        [tree(1, []),\
                         tree(1, [])])])])


def count_nodes_rec(t):
    """
    >> t = tree(8, [tree(4, [tree(2, []), tree(3, [])]), tree(3, [tree(1, []), tree(1, [tree(1, []), tree(1, [])])])])
    >> count_nodes_rec(t)
    9
    """
    #leafs have no children
    if is_leaf(t):
        return 1
    #if it isnt a leaf, it has branches
    #each branch is a tree
    return 1 + sum([count_nodes_rec(t) for t in get_branches(t)])


def sum_up_nodes(t):
    """
    >> t = tree(8, [tree(4, [tree(2, []), tree(3, [])]), tree(3, [tree(1, []), tree(1, [tree(1, []), tree(1, [])])])])
    >> count_nodes_rec(t)
    9
    """
    return get_label(t) + sum([sum_up_nodes(t) for t in get_branches(t)])


def collect_leaves(t):
    leaves = []
    if is_leaf(t):
        return [get_label(t)]
    for branch in get_branches(t):
        leaves += collect_leaves(branch)
    return leaves


def print_tree(t, indent_char="\t", indent=0):
        print("{0}{1}\n".format(indent * indent_char, get_label(t)), end='')
        if not is_leaf(t):
            for branch in get_branches(t):
                print_tree(branch, indent_char, indent + 1)


def map_tree(f, t):
    return [f(get_label(t))] + [map_tree(f, b) for b in get_branches(t)]



print_tree(map_tree(lambda x: x * 3, t))


#+end_src

#+RESULTS:
: 24
: 	12
: 		6
: 		9
: 	9
: 		3
: 		3
: 			3
: 			3




#+begin_src python :exports tangle:yes

#how to flatten a list

def flatten_list_1(l):
    f = lambda x: x[0]
    return [f(e) for e in l]

# but this loses information
# how about


def flatten_list_2(l):
    result = []
    for s in l:
        result += s
    return result


return flatten_list_2([[2], [1, 2, 3], [4, 5], "adsfaf"])


# now
# how to flatten arbitrarily nested list

#+end_src

#+RESULTS:
| 2 | 1 | 2 | 3 | 4 | 5 | a | d | s | f | a | f |



Are arbitrarily nested lists trees?

lets take a nested list [ [ [ 1, 2 ], [ 1 ], [ 1 ] ]

it can be represented by this tree:


            []
           /  \
          []  []
         /  \   \
        []  []    1
       /  \  \
      1   2   1


#+begin_src python :exports tangle:yes

l = [[[1, [1, 2], 2], [1]], [1]]

def flatten_list(l, treat_str_as_list=False):
    """

lets take a nested list [ [ [ 1, 2 ], [ 1 ], [ 1 ] ]

it can be represented by this tree:


            []
           /  \
          []  []
         /  \   \
        []  []    1
       /  \  \
      1   2   1

  can treat strings  as lists of 1 char strings
>> flatten_list([[1, 2], [1, [1, 2, 3], [1, 2, [3, 4, [6, 7]]]]])
    [1, 2, 1, 1, 2, 3, 1, 2, 3, 4, 6, 7]
    """
    #there are kinds of nodes in this tree, "list nodes" and leaves
    # we only wants to collect and aggregate leaves

    if isinstance(l, str) and len(l) > 1 and treat_str_as_list:
        # treat string as list of one-character strings
        l = list(l)

    if isinstance(l, list):
        # l is a list, attempt to flatten it
        # return [flatten_nested_list(elem) for elem in l]
        r = []
        for elem in l:
            r += flatten_list(elem, treat_str_as_list)
        return r

    else:
        #if l is a leaf return it
        return [l]

return flatten_list([[], []])


#+end_src

#+RESULTS:





